[Killed] PublicVisibility
Core/Contract/AbstractMapper.php:27:5
      *
      * @throws MapperActionMismatchException
      */
-    final public static function map(
+    final protected static function map(
         AbstractAction $action,
         array $response,
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.71823f4ddf95e31054c755c74ed47e05.infection.xml

E

Time: 00:00.019, Memory: 10.00 MB

[Killed] NotIdentical
Core/Contract/AbstractMapper.php:31:9
         AbstractAction $action,
         array $response,
     ): ResponseInterface {
-        if ($action::class !== static::getAction()) {
+        if ($action::class === static::getAction()) {
             throw new MapperActionMismatchException(mapperClass: static::class, expectedActionClass: static::getAction(), actualActionClass: $action::class);
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5c1f1a8a4cb76a086be126f393173f0b.infection.xml

E

Time: 00:00.022, Memory: 10.00 MB
