[Killed] PublicVisibility
Core/Contract/AbstractAction.php:18:5
         private readonly ?AuthorizationConfig $authorization,
     ) {}
 
-    final public static function create(
+    final protected static function create(
         string $method,
         string $path,
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.e1a3311222b8cb9fd15c48c71d573df5.infection.xml

E

Time: 00:00.016, Memory: 12.00 MB

[Killed] PublicVisibility
Core/Contract/AbstractAction.php:27:5
         return new static($method, $path, $body, $authorization);
     }
 
-    final public function getMethod(): string
+    final protected function getMethod(): string
     {
         return $this->method;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c3f6fc479efd86a5bb134a7129e9a246.infection.xml

E

Time: 00:00.015, Memory: 12.00 MB

[Killed] PublicVisibility
Core/Contract/AbstractAction.php:32:5
         return $this->method;
     }
 
-    final public function getPath(?ActionContextInterface $context = null): string
+    final protected function getPath(?ActionContextInterface $context = null): string
     {
         $resolver = $this->resolvePathCallback();
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.63ae058818240f42373307bbdbbd005b.infection.xml

E

Time: 00:00.018, Memory: 12.00 MB

[Killed] NotIdentical
Core/Contract/AbstractAction.php:36:9
     {
         $resolver = $this->resolvePathCallback();
 
-        if (null !== $resolver) {
+        if (null === $resolver) {
             $result = $resolver($this->path, $context);
             if (!\is_string($result)) {
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.825a52521f76e567790b5dd51a2fd208.infection.xml

E

Time: 00:00.016, Memory: 12.00 MB

[Killed] LogicalNot
Core/Contract/AbstractAction.php:38:13
 
         if (null !== $resolver) {
             $result = $resolver($this->path, $context);
-            if (!\is_string($result)) {
+            if (\is_string($result)) {
                 throw PathResolutionException::resolverDidNotReturnString();
             }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.f3830cd62e10703762b54332526ae8d3.infection.xml

E

Time: 00:00.015, Memory: 10.00 MB

[Killed] Throw_
Core/Contract/AbstractAction.php:39:17
         if (null !== $resolver) {
             $result = $resolver($this->path, $context);
             if (!\is_string($result)) {
-                throw PathResolutionException::resolverDidNotReturnString();
+                PathResolutionException::resolverDidNotReturnString();
             }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.087b498d26174e0603f65fa83e8640f5.infection.xml

F

Time: 00:00.013, Memory: 10.00 MB

[Killed] PublicVisibility
Core/Contract/AbstractAction.php:48:5
         return $this->defaultResolvePath($this->path, $context);
     }
 
-    final public function getRawPath(): string
+    final protected function getRawPath(): string
     {
         return $this->path;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d8d6fa2f10a70c6b6bd7772d7b1dd323.infection.xml

E

Time: 00:00.018, Memory: 10.00 MB

[Killed] PublicVisibility
Core/Contract/AbstractAction.php:53:5
         return $this->path;
     }
 
-    final public function getBody(): ?ActionBodyInterface
+    final protected function getBody(): ?ActionBodyInterface
     {
         return $this->body;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d782f6227c0f2028e02176f45b7b4a60.infection.xml

E

Time: 00:00.015, Memory: 12.00 MB

[Killed] PublicVisibility
Core/Contract/AbstractAction.php:58:5
         return $this->body;
     }
 
-    final public function getAuthorization(): ?AuthorizationConfig
+    final protected function getAuthorization(): ?AuthorizationConfig
     {
         return $this->authorization;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d563804fd512eadc626a852f068985ac.infection.xml

E

Time: 00:00.016, Memory: 12.00 MB

[Killed] ProtectedVisibility
Core/Contract/AbstractAction.php:72:5
      */
     abstract public static function mapper(): ?string;
 
-    protected function resolvePathCallback(): ?callable
+    private function resolvePathCallback(): ?callable
     {
         return null;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.1edcfd262fd07a1ee60c88f421f6b100.infection.xml

F

Time: 00:00.016, Memory: 12.00 MB

[Killed] Coalesce
Core/Contract/AbstractAction.php:79:9
 
     final protected function defaultResolvePath(string $path, ?ActionContextInterface $context): string
     {
-        $contextData = $context?->toArray() ?? [];
+        $contextData = [] ?? $context?->toArray();
 
         return preg_replace_callback(
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.cd4df0741cf8b2a3528c6f423a47415d.infection.xml

E

Time: 00:00.014, Memory: 12.00 MB

[Killed] NullSafeMethodCall
Core/Contract/AbstractAction.php:79:9
 
     final protected function defaultResolvePath(string $path, ?ActionContextInterface $context): string
     {
-        $contextData = $context?->toArray() ?? [];
+        $contextData = $context->toArray() ?? [];
 
         return preg_replace_callback(
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.ce6574c52f0c81e8a04e6514481d1bf8.infection.xml

E

Time: 00:00.013, Memory: 12.00 MB

[Killed] Coalesce
Core/Contract/AbstractAction.php:81:9
     {
         $contextData = $context?->toArray() ?? [];
 
-        return preg_replace_callback(
-            '/\{(\w+)\}/',
-            static function (array $matches) use ($contextData, $path) {
-                $key = $matches[1];
-
-                if (!\array_key_exists($key, $contextData)) {
-                    throw PathResolutionException::missingParameter($key, $path);
-                }
-
-                $value = $contextData[$key];
-                if (!\is_scalar($value)) {
-                    throw PathResolutionException::nonScalarParameter($key);
-                }
-
-                return (string) $value;
-            },
-            $path
-        ) ?? $path;
+        return $path ?? preg_replace_callback(
+        );
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.33f4495dc9b9726ddfeb137cfd74cd7a.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB

[Killed] DecrementInteger
Core/Contract/AbstractAction.php:84:17
         return preg_replace_callback(
             '/\{(\w+)\}/',
             static function (array $matches) use ($contextData, $path) {
-                $key = $matches[1];
+                $key = $matches[0];
 
                 if (!\array_key_exists($key, $contextData)) {
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.17fa18dfbd3cd9c7510d2b80f795b86b.infection.xml

E

Time: 00:00.014, Memory: 10.00 MB

[Killed] IncrementInteger
Core/Contract/AbstractAction.php:84:17
         return preg_replace_callback(
             '/\{(\w+)\}/',
             static function (array $matches) use ($contextData, $path) {
-                $key = $matches[1];
+                $key = $matches[2];
 
                 if (!\array_key_exists($key, $contextData)) {
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c861584af7bec03fd90c53b85713383d.infection.xml

E

Time: 00:00.027, Memory: 12.00 MB

[Killed] LogicalNot
Core/Contract/AbstractAction.php:86:17
             static function (array $matches) use ($contextData, $path) {
                 $key = $matches[1];
 
-                if (!\array_key_exists($key, $contextData)) {
+                if (\array_key_exists($key, $contextData)) {
                     throw PathResolutionException::missingParameter($key, $path);
                 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5d1b84750ca4cd62b15b9740cdafa62f.infection.xml

E

Time: 00:00.016, Memory: 10.00 MB

[Killed] Throw_
Core/Contract/AbstractAction.php:87:21
                 $key = $matches[1];
 
                 if (!\array_key_exists($key, $contextData)) {
-                    throw PathResolutionException::missingParameter($key, $path);
+                    PathResolutionException::missingParameter($key, $path);
                 }
 
killedBy: IntegrationEngine\Tests\Core\AbstractActionTest::getPathThrowsForMissingPlaceholder
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.a39f63e5ed41a5113a61ad7f7fb069ea.infection.xml

F

Time: 00:00.018, Memory: 10.00 MB

[Killed] LogicalNot
Core/Contract/AbstractAction.php:91:17
                 }
 
                 $value = $contextData[$key];
-                if (!\is_scalar($value)) {
+                if (\is_scalar($value)) {
                     throw PathResolutionException::nonScalarParameter($key);
                 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.2b1360b92a7fa4696264b8b067cdc6c1.infection.xml

E

Time: 00:00.015, Memory: 10.00 MB

[Killed] Throw_
Core/Contract/AbstractAction.php:92:21
 
                 $value = $contextData[$key];
                 if (!\is_scalar($value)) {
-                    throw PathResolutionException::nonScalarParameter($key);
+                    PathResolutionException::nonScalarParameter($key);
                 }
 
killedBy: IntegrationEngine\Tests\Core\AbstractActionTest::getPathThrowsForNonScalarPlaceholderValue
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b2ef9b3dc17b19023f5054bdb8e87bc2.infection.xml

F

Time: 00:00.017, Memory: 10.00 MB

[Killed] ReturnRemoval
Core/Contract/AbstractAction.php:95:17
                     throw PathResolutionException::nonScalarParameter($key);
                 }
 
-                return (string) $value;
+                
             },
             $path
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5e6f5ffc791c9efe4851908f5a4be4b2.infection.xml

F

Time: 00:00.017, Memory: 12.00 MB
