[Killed] MethodCallRemoval
Core/Contract/DynamicAuthorizationConfig.php:16:9
         public string $header = 'Authorization',
         public string $prefix = 'Bearer',
     ) {
-        parent::__construct('dynamic');
+        
     }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c66f1f7e6271918421ad9260b66981be.infection.xml

E

Time: 00:00.016, Memory: 10.00 MB
