[Killed] MethodCallRemoval
Core/Exception/ActionNotFoundException.php:11:9
 {
     public function __construct(string $actionName)
     {
-        parent::__construct("Action [{$actionName}] not found");
+        
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.f83a8add04ee831e78dd2bec45a6a5e6.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB
