[Killed] MethodCallRemoval
Core/Contract/StaticAuthorizationConfig.php:16:9
         string $type,
         public readonly array $params = [],
     ) {
-        parent::__construct($type);
+        
     }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.9ccb4804c01013c466265b14c9e79284.infection.xml

E

Time: 00:00.018, Memory: 12.00 MB
