[Killed] MethodCallRemoval
Core/Exception/IntegrationNotFoundException.php:11:9
 {
     public function __construct(string $name)
     {
-        parent::__construct(
-            \sprintf('Integration "%s" is not registered. Did you configure it under integration_engine.integrations?', $name)
-        );
+        
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.196578e278aed2666a3c5fcb686121be.infection.xml

F

Time: 00:00.017, Memory: 10.00 MB
