[Killed] PublicVisibility
Core/Exception/DynamicAuthException.php:9:5
 
 final class DynamicAuthException extends \RuntimeException
 {
-    public static function missingTokenField(string $action, string $field): self
+    protected static function missingTokenField(string $action, string $field): self
     {
         return new self(\sprintf(
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.1224b4ce82de6a857f8113d11befa578.infection.xml

F

Time: 00:00.019, Memory: 12.00 MB

[Killed] PublicVisibility
Core/Exception/DynamicAuthException.php:18:5
         ));
     }
 
-    public static function nonScalarTokenField(string $field): self
+    protected static function nonScalarTokenField(string $field): self
     {
         return new self(\sprintf('Token field "%s" must be a scalar value.', $field));
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.aef1730729ec731798df42261a7b3b10.infection.xml

E

Time: 00:00.016, Memory: 10.00 MB
