[Killed] MethodCallRemoval
Core/Exception/MapperActionMismatchException.php:11:9
 {
     public function __construct(string $mapperClass, string $expectedActionClass, string $actualActionClass)
     {
-        parent::__construct(
-            \sprintf(
-                'Mapper "%s" expects action "%s" but received "%s".',
-                $mapperClass,
-                $expectedActionClass,
-                $actualActionClass,
-            )
-        );
+        
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.8c6afcb3f4e456d8e1871d24f3d4f940.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB
