[Killed] MethodCallRemoval
Core/Exception/NotMappedActionException.php:11:9
 {
     public function __construct(string $action)
     {
-        parent::__construct(
-            \sprintf('Action "%s" requires a mapper but none was defined.', $action)
-        );
+        
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.e07baeeceec7f55c7e878d299e33ff51.infection.xml

F

Time: 00:00.015, Memory: 12.00 MB
