[Killed] PublicVisibility
Core/IntegrationEngine.php:31:5
         private string $integrationName,
     ) {}
 
-    public function send(
+    protected function send(
         string $actionName,
         ?ActionContextInterface $context = null,
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c67cefe3bff7a09499a28a9f9b95cf23.infection.xml

E

Time: 00:00.023, Memory: 10.00 MB

[Killed] LogicalNot
Core/IntegrationEngine.php:42:9
 
         $rawResponse = $this->client->send($action, $context, $headers);
 
-        if (!$action::hasResponse()) {
+        if ($action::hasResponse()) {
             return new EmptyResponse();
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.22ad5122772b3604735c4ce9c85cd02f.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] ReturnRemoval
Core/IntegrationEngine.php:43:13
         $rawResponse = $this->client->send($action, $context, $headers);
 
         if (!$action::hasResponse()) {
-            return new EmptyResponse();
+            
         }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.12b7fe13355562beb9639e471dfa0889.infection.xml

E

Time: 00:00.017, Memory: 10.00 MB

[Killed] InstanceOf_
Core/IntegrationEngine.php:54:9
     ): AbstractAction {
         $auth = $action->getAuthorization();
 
-        if (!$auth instanceof DynamicAuthorizationConfig) {
+        if ($auth instanceof DynamicAuthorizationConfig) {
             return $action;
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.e72d794f143a4e48639abb02ce7520af.infection.xml

E

Time: 00:00.014, Memory: 10.00 MB

[Killed] ReturnRemoval
Core/IntegrationEngine.php:55:13
         $auth = $action->getAuthorization();
 
         if (!$auth instanceof DynamicAuthorizationConfig) {
-            return $action;
+            
         }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b52353cc2c0b3250070b741b9261bc56.infection.xml

E

Time: 00:00.016, Memory: 10.00 MB

[Killed] Identical
Core/IntegrationEngine.php:60:9
 
         $token = $this->resolveToken($auth);
 
-        $isDefaultHeader = 'Authorization' === $auth->header;
+        $isDefaultHeader = 'Authorization' !== $auth->header;
 
         return $action::create(
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b50fd8a4ad97b346bb2ad6c90e051727.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] Ternary
Core/IntegrationEngine.php:67:17
             path: $action->getRawPath(),
             body: $action->getBody(),
             authorization: new StaticAuthorizationConfig(
-                type: $isDefaultHeader ? 'bearer' : 'api_key',
+                type: $isDefaultHeader ? 'api_key' : 'bearer',
                 params: $isDefaultHeader
                     ? ['token' => $token, 'prefix' => $auth->prefix]
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.afa299e7eb054eb9717af416e0f3536d.infection.xml

F

Time: 00:00.024, Memory: 12.00 MB

[Killed] Ternary
Core/IntegrationEngine.php:68:17
             body: $action->getBody(),
             authorization: new StaticAuthorizationConfig(
                 type: $isDefaultHeader ? 'bearer' : 'api_key',
-                params: $isDefaultHeader
-                    ? ['token' => $token, 'prefix' => $auth->prefix]
-                    : ['header' => $auth->header, 'token' => $token],
+                params: $isDefaultHeader ? ['header' => $auth->header, 'token' => $token] : ['token' => $token, 'prefix' => $auth->prefix],->header, 'token' => $token],
             ),
         );
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c4ec68b27539c22a2df08f558da5c4cd.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB

[Killed] ArrayItemRemoval
Core/IntegrationEngine.php:69:21
             authorization: new StaticAuthorizationConfig(
                 type: $isDefaultHeader ? 'bearer' : 'api_key',
                 params: $isDefaultHeader
-                    ? ['token' => $token, 'prefix' => $auth->prefix]
+                    ? ['prefix' => $auth->prefix]
                     : ['header' => $auth->header, 'token' => $token],
             ),
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.04153a4810dcdc63f2392e40a30b509d.infection.xml

F

Time: 00:00.022, Memory: 12.00 MB

[Killed] ArrayItemRemoval
Core/IntegrationEngine.php:70:21
                 type: $isDefaultHeader ? 'bearer' : 'api_key',
                 params: $isDefaultHeader
                     ? ['token' => $token, 'prefix' => $auth->prefix]
-                    : ['header' => $auth->header, 'token' => $token],
+                    : ['token' => $token],
             ),
         );
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.a735bec0370928fe520456039655f24a.infection.xml

F

Time: 00:00.023, Memory: 12.00 MB

[Killed] IfNegation
Core/IntegrationEngine.php:80:9
         $cacheKey = \sprintf('integration_engine.token.%s.%s', $this->integrationName, $authConfig->action);
 
         $cached = $this->cache->get($cacheKey);
-        if (\is_string($cached)) {
-            return $cached;
-        }
+        if (!\is_string($cached)) {
 
         $authAction = $this->config->getAction($authConfig->action, null);
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d89725f993b8ba6615066629a6e54545.infection.xml

E

Time: 00:00.018, Memory: 10.00 MB

[Killed] ReturnRemoval
Core/IntegrationEngine.php:81:13
 
         $cached = $this->cache->get($cacheKey);
         if (\is_string($cached)) {
-            return $cached;
+            
         }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b0b0fb14e624858b13693e328fc8d26a.infection.xml

F

Time: 00:00.016, Memory: 12.00 MB

[Killed] LogicalNot
Core/IntegrationEngine.php:90:9
         $authResponse = $this->applyMapper($authAction, $rawResponse);
         $responseArray = $authResponse->toArray();
 
-        if (!isset($responseArray[$authConfig->tokenField])) {
+        if (isset($responseArray[$authConfig->tokenField])) {
             throw DynamicAuthException::missingTokenField($authConfig->action, $authConfig->tokenField);
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.8c8361854fdd60a48bcd9918fbd67502.infection.xml

E

Time: 00:00.027, Memory: 10.00 MB

[Killed] Throw_
Core/IntegrationEngine.php:91:13
         $responseArray = $authResponse->toArray();
 
         if (!isset($responseArray[$authConfig->tokenField])) {
-            throw DynamicAuthException::missingTokenField($authConfig->action, $authConfig->tokenField);
+            DynamicAuthException::missingTokenField($authConfig->action, $authConfig->tokenField);
         }
 
killedBy: IntegrationEngine\Tests\Core\DynamicAuthTest::dynamicAuthThrowsWhenTokenFieldMissing
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.7f3da9378aa1939ed971a792427e43fe.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] LogicalNot
Core/IntegrationEngine.php:95:9
         }
 
         $tokenValue = $responseArray[$authConfig->tokenField];
-        if (!\is_scalar($tokenValue)) {
+        if (\is_scalar($tokenValue)) {
             throw DynamicAuthException::nonScalarTokenField($authConfig->tokenField);
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.4fac157eadd287a16bebdbad1553a6fc.infection.xml

E

Time: 00:00.016, Memory: 10.00 MB

[Killed] MethodCallRemoval
Core/IntegrationEngine.php:101:9
 
         $token = (string) $tokenValue;
 
-        $this->cache->set($cacheKey, $token, $authConfig->ttl);
+        
 
         return $token;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.2f9495402d12aaf5fac3a5cc6079abf1.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] Identical
Core/IntegrationEngine.php:113:9
     {
         $mapperClass = $action::mapper();
 
-        if (null === $mapperClass) {
+        if (null !== $mapperClass) {
             throw new NotMappedActionException($action::getName());
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.9952e241e35f786bc35a1597c65eb267.infection.xml

E

Time: 00:00.018, Memory: 10.00 MB

[Killed] Throw_
Core/IntegrationEngine.php:114:13
         $mapperClass = $action::mapper();
 
         if (null === $mapperClass) {
-            throw new NotMappedActionException($action::getName());
+            new NotMappedActionException($action::getName());
         }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.dbc988e4dd30d81b7737cf8ba0af9b4c.infection.xml

F

Time: 00:00.018, Memory: 10.00 MB

[Killed] NotIdentical
Core/IntegrationEngine.php:121:9
         // from custom ConfigPort or ClientInterface implementations.
         // AbstractMapper::map() carries the same guard as a public contract
         // for callers that use it outside the engine flow.
-        if ($mapperClass::getAction() !== $action::class) {
+        if ($mapperClass::getAction() === $action::class) {
             throw new MapperActionMismatchException(
                 mapperClass: $mapperClass,
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.e0ed7faf9a06135a7bf002eaeafb9e0e.infection.xml

E

Time: 00:00.018, Memory: 10.00 MB

[Survived] Throw_
Core/IntegrationEngine.php:122:13
         // AbstractMapper::map() carries the same guard as a public contract
         // for callers that use it outside the engine flow.
         if ($mapperClass::getAction() !== $action::class) {
-            throw new MapperActionMismatchException(
-                mapperClass: $mapperClass,
-                expectedActionClass: $mapperClass::getAction(),
-                actualActionClass: $action::class
-            );
+            new MapperActionMismatchException(
         }
 
