[Killed] PublicVisibility
Core/Exception/PathResolutionException.php:9:5
 
 final class PathResolutionException extends \RuntimeException
 {
-    public static function missingParameter(string $key, string $path): self
+    protected static function missingParameter(string $key, string $path): self
     {
         return new self(\sprintf('Missing path parameter "%s" for path "%s".', $key, $path));
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.908c65f5df1fa128d17fcb02dc71b385.infection.xml

F

Time: 00:00.016, Memory: 10.00 MB

[Killed] PublicVisibility
Core/Exception/PathResolutionException.php:14:5
         return new self(\sprintf('Missing path parameter "%s" for path "%s".', $key, $path));
     }
 
-    public static function nonScalarParameter(string $key): self
+    protected static function nonScalarParameter(string $key): self
     {
         return new self(\sprintf('Path parameter "%s" must be a scalar value.', $key));
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5ef425cf8ce1108a8ab400a080375d15.infection.xml

F

Time: 00:00.018, Memory: 10.00 MB

[Killed] PublicVisibility
Core/Exception/PathResolutionException.php:19:5
         return new self(\sprintf('Path parameter "%s" must be a scalar value.', $key));
     }
 
-    public static function resolverDidNotReturnString(): self
+    protected static function resolverDidNotReturnString(): self
     {
         return new self('Path resolver must return a string.');
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.70e483e1861a0283f43d9dbc744121bb.infection.xml

F

Time: 00:00.015, Memory: 10.00 MB
