[Killed] InstanceOf_
Infrastructure/Http/GraphQLClientAdapter.php:52:9
     ): array {
         $body = $action->getBody();
 
-        if (!$body instanceof GraphQLBodyInterface) {
+        if ($body instanceof GraphQLBodyInterface) {
             throw new RequestResponseException(
                 statusCode: 0,
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b0792288bb95a29197fe92dc2a404f35.infection.xml

E

Time: 00:00.018, Memory: 10.00 MB

[Killed] Throw_
Infrastructure/Http/GraphQLClientAdapter.php:53:13
         $body = $action->getBody();
 
         if (!$body instanceof GraphQLBodyInterface) {
-            throw new RequestResponseException(
-                statusCode: 0,
-                context: \sprintf(
-                    'GraphQLClientAdapter requires a GraphQLBodyInterface body. Got %s for action "%s".',
-                    null !== $body ? $body::class : 'null',
-                    $action::getName(),
-                )
-            );
+            new RequestResponseException(
         }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.665ef6572779b0d50d12ddfa9ae54a44.infection.xml

F

Time: 00:00.014, Memory: 10.00 MB

[Killed] IncrementInteger
Infrastructure/Http/GraphQLClientAdapter.php:54:17
 
         if (!$body instanceof GraphQLBodyInterface) {
             throw new RequestResponseException(
-                statusCode: 0,
+                statusCode: 1,
                 context: \sprintf(
                     'GraphQLClientAdapter requires a GraphQLBodyInterface body. Got %s for action "%s".',
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c71fec0155cb0293d46b373187c2fd19.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] DecrementInteger
Infrastructure/Http/GraphQLClientAdapter.php:54:17
 
         if (!$body instanceof GraphQLBodyInterface) {
             throw new RequestResponseException(
-                statusCode: 0,
+                statusCode: -1,
                 context: \sprintf(
                     'GraphQLClientAdapter requires a GraphQLBodyInterface body. Got %s for action "%s".',
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.41b539a03c44a8f3d80b079805f7820f.infection.xml

F

Time: 00:00.016, Memory: 12.00 MB

[Killed] Ternary
Infrastructure/Http/GraphQLClientAdapter.php:57:21
                 statusCode: 0,
                 context: \sprintf(
                     'GraphQLClientAdapter requires a GraphQLBodyInterface body. Got %s for action "%s".',
-                    null !== $body ? $body::class : 'null',
+                    null !== $body ? 'null' : $body::class,
                     $action::getName(),
                 )
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.adedf35ee907b2bd6710c27e373287f8.infection.xml

F

Time: 00:00.016, Memory: 10.00 MB

[Killed] UnwrapArrayMerge
Infrastructure/Http/GraphQLClientAdapter.php:64:13
         }
 
         $options = [
-            'headers' => array_merge(
-                ['Content-Type' => 'application/json', 'Accept' => 'application/json'],
-                $this->defaultHeaders,
-                $this->resolveHeaders($action),
-                $headers?->toArray() ?? [],
-            ),
+            'headers' => ['Content-Type' => 'application/json', 'Accept' => 'application/json'],
             'json' => [
                 'query' => $body->getQuery(),
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.2f1b6680ebe21dda7ea969d8c0f1414e.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] ArrayItemRemoval
Infrastructure/Http/GraphQLClientAdapter.php:65:17
 
         $options = [
             'headers' => array_merge(
-                ['Content-Type' => 'application/json', 'Accept' => 'application/json'],
+                ['Accept' => 'application/json'],
                 $this->defaultHeaders,
                 $this->resolveHeaders($action),
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.679aa4542e99014200249418a38128fa.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] NullSafeMethodCall
Infrastructure/Http/GraphQLClientAdapter.php:68:17
                 ['Content-Type' => 'application/json', 'Accept' => 'application/json'],
                 $this->defaultHeaders,
                 $this->resolveHeaders($action),
-                $headers?->toArray() ?? [],
+                $headers->toArray() ?? [],
             ),
             'json' => [
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b1cb06ba0186082da05112cadb28b3aa.infection.xml

E

Time: 00:00.016, Memory: 10.00 MB

[Killed] Coalesce
Infrastructure/Http/GraphQLClientAdapter.php:68:17
                 ['Content-Type' => 'application/json', 'Accept' => 'application/json'],
                 $this->defaultHeaders,
                 $this->resolveHeaders($action),
-                $headers?->toArray() ?? [],
+                [] ?? $headers?->toArray(),
             ),
             'json' => [
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.6fccbef7d5dbc0cfdb29ab044f17000a.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] ArrayItem
Infrastructure/Http/GraphQLClientAdapter.php:72:17
             ),
             'json' => [
                 'query' => $body->getQuery(),
-                'variables' => $body->getVariables(),
+                'variables' > $body->getVariables(),
             ],
         ];
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.4c8947b7935fdfc46ce19d506368be60.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] GreaterThanOrEqualToNegotiation
Infrastructure/Http/GraphQLClientAdapter.php:81:13
 
             $statusCode = $response->getStatusCode();
 
-            if ($statusCode >= 400) {
+            if ($statusCode < 400) {
                 throw new RequestResponseException(
                     statusCode: $statusCode,
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.188a768300f26624cf41333c9ed09336.infection.xml

E

Time: 00:00.018, Memory: 12.00 MB

[Survived] GreaterThanOrEqualTo
Infrastructure/Http/GraphQLClientAdapter.php:81:13
 
             $statusCode = $response->getStatusCode();
 
-            if ($statusCode >= 400) {
+            if ($statusCode > 400) {
                 throw new RequestResponseException(
                     statusCode: $statusCode,

[Killed] Throw_
Infrastructure/Http/GraphQLClientAdapter.php:82:17
             $statusCode = $response->getStatusCode();
 
             if ($statusCode >= 400) {
-                throw new RequestResponseException(
-                    statusCode: $statusCode,
-                    context: \sprintf(
-                        'GraphQL endpoint %s returned HTTP %d: %s',
-                        $this->endpointUrl,
-                        $statusCode,
-                        $response->getContent(throw: false)
-                    )
-                );
+                new RequestResponseException(
             }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c902af8eccd6bbc5dfc01535e4deee16.infection.xml

F

Time: 00:00.016, Memory: 10.00 MB

[Survived] FalseValue
Infrastructure/Http/GraphQLClientAdapter.php:88:25
                         'GraphQL endpoint %s returned HTTP %d: %s',
                         $this->endpointUrl,
                         $statusCode,
-                        $response->getContent(throw: false)
+                        $response->getContent(throw: true)
                     )
                 );

[Killed] LogicalNot
Infrastructure/Http/GraphQLClientAdapter.php:97:13
 
             // GraphQL always returns 200, even on errors.
             // Errors are signalled inside the response body under the "errors" key.
-            if (!empty($data['errors'])) {
+            if (empty($data['errors'])) {
                 $message = \is_string($data['errors'][0]['message'] ?? null)
                     ? $data['errors'][0]['message']
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b7930c9d12f8e48e4dbb4a11445c7344.infection.xml

E

Time: 00:00.032, Memory: 12.00 MB

[Killed] Ternary
Infrastructure/Http/GraphQLClientAdapter.php:98:17
             // GraphQL always returns 200, even on errors.
             // Errors are signalled inside the response body under the "errors" key.
             if (!empty($data['errors'])) {
-                $message = \is_string($data['errors'][0]['message'] ?? null)
-                    ? $data['errors'][0]['message']
-                    : 'GraphQL error';
+                $message = \is_string($data['errors'][0]['message'] ?? null) ? 'GraphQL error' : $data['errors'][0]['message'];
 
                 throw new RequestResponseException(
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.49da21c41ed13c56c0a97b2b1232a4fa.infection.xml

F

Time: 00:00.030, Memory: 12.00 MB

[Killed] IncrementInteger
Infrastructure/Http/GraphQLClientAdapter.php:98:17
             // GraphQL always returns 200, even on errors.
             // Errors are signalled inside the response body under the "errors" key.
             if (!empty($data['errors'])) {
-                $message = \is_string($data['errors'][0]['message'] ?? null)
+                $message = \is_string($data['errors'][1]['message'] ?? null)
                     ? $data['errors'][0]['message']
                     : 'GraphQL error';
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.9b9fb54dac84f81fb684974721f86124.infection.xml

F

Time: 00:00.014, Memory: 12.00 MB

[Killed] IncrementInteger
Infrastructure/Http/GraphQLClientAdapter.php:99:21
             // Errors are signalled inside the response body under the "errors" key.
             if (!empty($data['errors'])) {
                 $message = \is_string($data['errors'][0]['message'] ?? null)
-                    ? $data['errors'][0]['message']
+                    ? $data['errors'][1]['message']
                     : 'GraphQL error';
 
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::graphQLErrorsInResponseThrowsRequestResponseException
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.aa2109a2cdf42e2d925547b7539a3bb3.infection.xml

F

Time: 00:00.028, Memory: 12.00 MB

[Killed] Throw_
Infrastructure/Http/GraphQLClientAdapter.php:102:17
                     ? $data['errors'][0]['message']
                     : 'GraphQL error';
 
-                throw new RequestResponseException(
-                    statusCode: 200,
-                    context: \sprintf(
-                        'GraphQL error on action "%s": %s',
-                        $action::getName(),
-                        $message,
-                    )
-                );
+                new RequestResponseException(
             }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.a3c55db70839622cd7144c1f8ae8bae4.infection.xml

F

Time: 00:00.016, Memory: 10.00 MB

[Killed] IncrementInteger
Infrastructure/Http/GraphQLClientAdapter.php:103:21
                     : 'GraphQL error';
 
                 throw new RequestResponseException(
-                    statusCode: 200,
+                    statusCode: 201,
                     context: \sprintf(
                         'GraphQL error on action "%s": %s',
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.42055f0199986473744c08b667a017f2.infection.xml

F

Time: 00:00.016, Memory: 12.00 MB

[Killed] DecrementInteger
Infrastructure/Http/GraphQLClientAdapter.php:103:21
                     : 'GraphQL error';
 
                 throw new RequestResponseException(
-                    statusCode: 200,
+                    statusCode: 199,
                     context: \sprintf(
                         'GraphQL error on action "%s": %s',
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.6ee3aeca1a6fac04c163ed8a1e26a95e.infection.xml

F

Time: 00:00.029, Memory: 12.00 MB

[Killed] ReturnRemoval
Infrastructure/Http/GraphQLClientAdapter.php:112:13
                 );
             }
 
-            return $data['data'] ?? [];
+            
         } catch (RequestResponseException $e) {
             throw $e;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d0218086c19b3a7bfb8cebefc3a35c45.infection.xml

E

Time: 00:00.014, Memory: 10.00 MB

[Killed] Coalesce
Infrastructure/Http/GraphQLClientAdapter.php:112:13
                 );
             }
 
-            return $data['data'] ?? [];
+            return [] ?? $data['data'];
         } catch (RequestResponseException $e) {
             throw $e;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.8b96c8d8e91969a196be22d902d688ba.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] Throw_
Infrastructure/Http/GraphQLClientAdapter.php:114:13
 
             return $data['data'] ?? [];
         } catch (RequestResponseException $e) {
-            throw $e;
+            $e;
         } catch (\Throwable $e) {
             throw new RequestResponseException(
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.6556c6b1fc0bffbc967fa66c057a3499.infection.xml

F

Time: 00:00.018, Memory: 10.00 MB

[Killed] InstanceOf_
Infrastructure/Http/GraphQLClientAdapter.php:133:9
         $headers = [];
         $auth = $action->getAuthorization();
 
-        if (!$auth instanceof StaticAuthorizationConfig) {
+        if ($auth instanceof StaticAuthorizationConfig) {
             return $headers;
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.a426d3536e1466846baf73d08cf5325f.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB

[Killed] ReturnRemoval
Infrastructure/Http/GraphQLClientAdapter.php:134:13
         $auth = $action->getAuthorization();
 
         if (!$auth instanceof StaticAuthorizationConfig) {
-            return $headers;
+            
         }
 
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::defaultHeadersAreSentWithContentType
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.470341b07b29916e87d591016b998665.infection.xml

..W

Time: 00:00.013, Memory: 10.00 MB

[Killed] LogicalAnd
Infrastructure/Http/GraphQLClientAdapter.php:137:9
             return $headers;
         }
 
-        $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
+        $token = isset($auth->params['token']) || \is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterHeadersTest::unknownAuthTypeAddsNoAuthHeader
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.43a4e64a16cb29fb8720d20de2ee3771.infection.xml

....................W

Time: 00:00.017, Memory: 10.00 MB

[Killed] LogicalAndAllSubExprNegation
Infrastructure/Http/GraphQLClientAdapter.php:137:9
             return $headers;
         }
 
-        $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
+        $token = !isset($auth->params['token']) && !\is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.18bf481709286a213d3bebccbf5d1f2f.infection.xml

F

Time: 00:00.023, Memory: 12.00 MB

[Killed] LogicalAndAllSubExprNegation
Infrastructure/Http/GraphQLClientAdapter.php:138:9
         }
 
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
-        $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
+        $username = !isset($auth->params['username']) && !\is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::bearerAuthHeaderIsApplied
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.22069677dd3074bfbdb22027601c1196.infection.xml

......W

Time: 00:00.014, Memory: 10.00 MB

[Killed] Ternary
Infrastructure/Http/GraphQLClientAdapter.php:138:9
         }
 
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
-        $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
+        $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? '' : $auth->params['username'];
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::bearerAuthHeaderIsApplied
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.adce9c7e7e766ccc573fbf8c6dbc402c.infection.xml

..........W

Time: 00:00.015, Memory: 10.00 MB

[Killed] Ternary
Infrastructure/Http/GraphQLClientAdapter.php:139:9
 
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
-        $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
+        $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? '' : $auth->params['password'];
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::bearerAuthHeaderIsApplied
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c93ecda9e68ba29179a7d6e237b6b15a.infection.xml

......W

Time: 00:00.017, Memory: 10.00 MB

[Killed] LogicalAndSingleSubExprNegation
Infrastructure/Http/GraphQLClientAdapter.php:139:9
 
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
-        $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
+        $password = isset($auth->params['password']) && !\is_string($auth->params['password']) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.ead36d824d524526f035c99c00d163e8.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] LogicalAnd
Infrastructure/Http/GraphQLClientAdapter.php:140:9
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
-        $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
+        $headerKey = isset($auth->params['header']) || \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
         $headers += match ($auth->type) {
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::bearerAuthHeaderIsApplied
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d6f4966149ee8e16dadc54c3a303cb65.infection.xml

......W

Time: 00:00.012, Memory: 10.00 MB

[Killed] LogicalAndAllSubExprNegation
Infrastructure/Http/GraphQLClientAdapter.php:140:9
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
-        $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
+        $headerKey = !isset($auth->params['header']) && !\is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
         $headers += match ($auth->type) {
killedBy: IntegrationEngine\Tests\Infrastructure\GraphQLClientAdapterTest::bearerAuthHeaderIsApplied
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b9632644fe393b44425236a89545befa.infection.xml

.....W

Time: 00:00.015, Memory: 10.00 MB

[Killed] MatchArmRemoval
Infrastructure/Http/GraphQLClientAdapter.php:142:9
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
-        $headers += match ($auth->type) {
-            'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
-            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
-            'api_key' => [$headerKey => $token],
-            default => [],
-        };
+        
 
         return $headers;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5303a9c2778831e9e1169974bf65fc21.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] Coalesce
Infrastructure/Http/GraphQLClientAdapter.php:143:13
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
         $headers += match ($auth->type) {
-            'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
+            'bearer' => ['Authorization' => \sprintf('%s %s', 'Bearer' ?? $auth->params['prefix'], $token)],
             'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
             'api_key' => [$headerKey => $token],
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5b7a86818e483639eb923535e9d12a99.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] Concat
Infrastructure/Http/GraphQLClientAdapter.php:144:13
 
         $headers += match ($auth->type) {
             'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
-            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
+            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode(':' . $username.$password))],
             'api_key' => [$headerKey => $token],
             default => [],
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.bac4ab2ffe5fcba2a2b8c94ecd614748.infection.xml

F

Time: 00:00.017, Memory: 12.00 MB

[Killed] ConcatOperandRemoval
Infrastructure/Http/GraphQLClientAdapter.php:144:13
 
         $headers += match ($auth->type) {
             'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
-            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
+            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'))],
             'api_key' => [$headerKey => $token],
             default => [],
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.76c5f98a6f44fee02aefa460f309d8f8.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB
