[Killed] ArrayItemRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:51:9
     ): array {
         $path = $action->getPath($context);
 
-        $options = [
-            'headers' => array_merge(
-                $this->defaultHeaders,
-                $this->resolveHeaders($action),
-                $headers?->toArray() ?? []
-            ),
-        ];
+        $options = [];
 
         $body = $action->getBody();
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.87d0d1f198f87ede10fb0c4590d8a6dd.infection.xml

F

Time: 00:00.017, Memory: 12.00 MB

[Killed] UnwrapArrayMerge
Infrastructure/Http/SymfonyHttpClientAdapter.php:52:13
         $path = $action->getPath($context);
 
         $options = [
-            'headers' => array_merge(
-                $this->defaultHeaders,
-                $this->resolveHeaders($action),
-                $headers?->toArray() ?? []
-            ),
+            'headers' => $headers?->toArray() ?? [],
         ];
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.f053b92382f1d677dedcb1aed0b6fda9.infection.xml

F

Time: 00:00.021, Memory: 12.00 MB

[Killed] NullSafeMethodCall
Infrastructure/Http/SymfonyHttpClientAdapter.php:55:17
             'headers' => array_merge(
                 $this->defaultHeaders,
                 $this->resolveHeaders($action),
-                $headers?->toArray() ?? []
+                $headers->toArray() ?? []
             ),
         ];
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.bc007ff20f5b7f76ba30dccb1d62c8eb.infection.xml

E

Time: 00:00.015, Memory: 12.00 MB

[Killed] Coalesce
Infrastructure/Http/SymfonyHttpClientAdapter.php:55:17
             'headers' => array_merge(
                 $this->defaultHeaders,
                 $this->resolveHeaders($action),
-                $headers?->toArray() ?? []
+                [] ?? $headers?->toArray()
             ),
         ];
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.cc3cb2f6332d86682b0a3e751e74febc.infection.xml

F

Time: 00:00.022, Memory: 12.00 MB

[Killed] LogicalAndNegation
Infrastructure/Http/SymfonyHttpClientAdapter.php:60:9
         ];
 
         $body = $action->getBody();
-        if (null !== $body && \in_array($action->getMethod(), ['POST', 'PUT', 'PATCH'], strict: true)) {
+        if (!(null !== $body && \in_array($action->getMethod(), ['POST', 'PUT', 'PATCH'], strict: true))) {
             $options['json'] = $body->toArray();
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.12c829aa1f4ea50c1f1e2843546f3425.infection.xml

E

Time: 00:00.017, Memory: 12.00 MB

[Killed] LogicalAndAllSubExprNegation
Infrastructure/Http/SymfonyHttpClientAdapter.php:60:9
         ];
 
         $body = $action->getBody();
-        if (null !== $body && \in_array($action->getMethod(), ['POST', 'PUT', 'PATCH'], strict: true)) {
+        if (!(null !== $body) && !\in_array($action->getMethod(), ['POST', 'PUT', 'PATCH'], strict: true)) {
             $options['json'] = $body->toArray();
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.9c000ee5b5647cd332cc259edd8d1eb1.infection.xml

E

Time: 00:00.017, Memory: 12.00 MB

[Killed] ConcatOperandRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:67:17
         try {
             $response = $this->httpClient->request(
                 $action->getMethod(),
-                $this->baseUrl.$path,
+                $this->baseUrl,
                 $options,
             );
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.cd43dabf7eb60bd5bc67a3d2a5b6ca69.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] ConcatOperandRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:67:17
         try {
             $response = $this->httpClient->request(
                 $action->getMethod(),
-                $this->baseUrl.$path,
+                $path,
                 $options,
             );
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.4124f2a4f6968afe7921f304152fb4be.infection.xml

F

Time: 00:00.016, Memory: 12.00 MB

[Killed] Throw_
Infrastructure/Http/SymfonyHttpClientAdapter.php:74:17
             $statusCode = $response->getStatusCode();
 
             if ($statusCode >= 400) {
-                throw new RequestResponseException(
-                    statusCode: $statusCode,
-                    context: \sprintf(
-                        '%s %s returned HTTP %d: %s',
-                        $action->getMethod(),
-                        $path,
-                        $statusCode,
-                        $response->getContent(throw: false)
-                    )
-                );
+                new RequestResponseException(
             }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.ae5403880553f2cb0dc216df8663eaac.infection.xml

F

Time: 00:00.020, Memory: 10.00 MB

[Survived] FalseValue
Infrastructure/Http/SymfonyHttpClientAdapter.php:86:13
                 );
             }
 
-            $content = $response->getContent(throw: false);
+            $content = $response->getContent(throw: true);
 
             if (204 === $statusCode || '' === trim($content)) {

[Killed] Identical
Infrastructure/Http/SymfonyHttpClientAdapter.php:88:13
 
             $content = $response->getContent(throw: false);
 
-            if (204 === $statusCode || '' === trim($content)) {
+            if (204 !== $statusCode || '' === trim($content)) {
                 return [];
             }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.49b801cde3e7454e5570b6bfcfb9ea60.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB

[Killed] IncrementInteger
Infrastructure/Http/SymfonyHttpClientAdapter.php:88:13
 
             $content = $response->getContent(throw: false);
 
-            if (204 === $statusCode || '' === trim($content)) {
+            if (205 === $statusCode || '' === trim($content)) {
                 return [];
             }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.02e71e07900b52db517c190557912cf3.infection.xml

F

Time: 00:00.016, Memory: 12.00 MB

[Killed] ReturnRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:89:17
             $content = $response->getContent(throw: false);
 
             if (204 === $statusCode || '' === trim($content)) {
-                return [];
+                
             }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.370b1e8608ba8c01d590365fb3f0a769.infection.xml

F

Time: 00:00.026, Memory: 12.00 MB

[Killed] ReturnRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:92:13
                 return [];
             }
 
-            return $response->toArray();
+            
         } catch (RequestResponseException $e) {
             throw $e;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.0a5604349a86b1b7d55060bf764ff848.infection.xml

E

Time: 00:00.016, Memory: 12.00 MB

[Killed] Throw_
Infrastructure/Http/SymfonyHttpClientAdapter.php:96:13
         } catch (RequestResponseException $e) {
             throw $e;
         } catch (\Throwable $e) {
-            throw new RequestResponseException(
-                statusCode: 0,
-                context: \sprintf(
-                    'Network error on %s %s: %s',
-                    $action->getMethod(),
-                    $path,
-                    $e->getMessage()
-                )
-            );
+            new RequestResponseException(
         }
     }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c4f1deb3f1ada2dd3e60fde86d965a6e.infection.xml

E

Time: 00:00.015, Memory: 10.00 MB

[Survived] ArrayOneItem
Infrastructure/Http/SymfonyHttpClientAdapter.php:116:13
         $auth = $action->getAuthorization();
 
         if (!$auth instanceof StaticAuthorizationConfig) {
-            return $headers;
+            return count($headers) > 1 ? array_slice($headers, 0, 1, true) : $headers;
         }
 

[Killed] LogicalAndSingleSubExprNegation
Infrastructure/Http/SymfonyHttpClientAdapter.php:119:9
             return $headers;
         }
 
-        $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
+        $token = isset($auth->params['token']) && !\is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.9d31e55046f4eebdea0a80d7dfd2c572.infection.xml

F

Time: 00:00.018, Memory: 12.00 MB

[Killed] LogicalAndSingleSubExprNegation
Infrastructure/Http/SymfonyHttpClientAdapter.php:120:9
         }
 
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
-        $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
+        $username = isset($auth->params['username']) && !\is_string($auth->params['username']) ? $auth->params['username'] : '';
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.c5c6f4a6c780eff4abf41116d03ae8ea.infection.xml

F

Time: 00:00.017, Memory: 12.00 MB

[Killed] LogicalAndNegation
Infrastructure/Http/SymfonyHttpClientAdapter.php:121:9
 
         $token = isset($auth->params['token']) && \is_string($auth->params['token']) ? $auth->params['token'] : '';
         $username = isset($auth->params['username']) && \is_string($auth->params['username']) ? $auth->params['username'] : '';
-        $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
+        $password = !(isset($auth->params['password']) && \is_string($auth->params['password'])) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.bb197545ea75a616a22ab9f8febfa5c0.infection.xml

F

Time: 00:00.019, Memory: 12.00 MB

[Killed] Assignment
Infrastructure/Http/SymfonyHttpClientAdapter.php:124:9
         $password = isset($auth->params['password']) && \is_string($auth->params['password']) ? $auth->params['password'] : '';
         $headerKey = isset($auth->params['header']) && \is_string($auth->params['header']) ? $auth->params['header'] : 'X-Api-Key';
 
-        $headers += match ($auth->type) {
-            'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
-            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
-            'api_key' => [$headerKey => $token],
-            default => [],
-        };
+        $headers = match ($auth->type) {
 
         return $headers;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.47c497b1f15164f56dedaa5133ba3505.infection.xml

F

Time: 00:00.010, Memory: 12.00 MB

[Killed] ConcatOperandRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:126:13
 
         $headers += match ($auth->type) {
             'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
-            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
+            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode(':'.$password))],
             'api_key' => [$headerKey => $token],
             default => [],
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.b7059c32ae46fd27dc552b363d2f28c9.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB

[Killed] ConcatOperandRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:126:13
 
         $headers += match ($auth->type) {
             'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
-            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
+            'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.$password))],
             'api_key' => [$headerKey => $token],
             default => [],
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.fcce288c6f5f02ea6f896fe9e31de761.infection.xml

F

Time: 00:00.017, Memory: 12.00 MB

[Killed] ArrayItemRemoval
Infrastructure/Http/SymfonyHttpClientAdapter.php:127:13
         $headers += match ($auth->type) {
             'bearer' => ['Authorization' => \sprintf('%s %s', $auth->params['prefix'] ?? 'Bearer', $token)],
             'basic' => ['Authorization' => \sprintf('Basic %s', base64_encode($username.':'.$password))],
-            'api_key' => [$headerKey => $token],
+            'api_key' => [],
             default => [],
         };
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.ba2dfa53d43734220fee15bbeb367a7b.infection.xml

F

Time: 00:00.014, Memory: 12.00 MB
