[Killed] ConcatOperandRemoval
Core/Exception/RequestResponseException.php:15:9
         public readonly int $statusCode,
         public readonly string $context,
     ) {
-        parent::__construct(self::ERROR.': '.$context, 0);
+        parent::__construct(': '.$context, 0);
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.442b0e62f69fed31052aee11a95003d6.infection.xml

F

Time: 00:00.020, Memory: 12.00 MB

[Killed] ConcatOperandRemoval
Core/Exception/RequestResponseException.php:15:9
         public readonly int $statusCode,
         public readonly string $context,
     ) {
-        parent::__construct(self::ERROR.': '.$context, 0);
+        parent::__construct(self::ERROR.': ', 0);
     }
 }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.bea8a3f02771271cf665c3e88b03dc85.infection.xml

F

Time: 00:00.019, Memory: 12.00 MB
