[Killed] Ternary
Infrastructure/Cache/Psr6CacheAdapter.php:20:9
     {
         $item = $this->pool->getItem($this->sanitizeKey($key));
 
-        return $item->isHit() ? $item->get() : null;
+        return $item->isHit() ? null : $item->get();
     }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.a02ec2836fd6982c4fb7b332de44f4eb.infection.xml

F

Time: 00:00.015, Memory: 10.00 MB

[Killed] MethodCallRemoval
Infrastructure/Cache/Psr6CacheAdapter.php:26:9
     public function set(string $key, mixed $value, int $ttl): void
     {
         $item = $this->pool->getItem($this->sanitizeKey($key));
-        $item->set($value);
+        
         $item->expiresAfter($ttl);
         $this->pool->save($item);
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.60980c4c4c2c7a65edba37b20312c796.infection.xml

F

Time: 00:00.014, Memory: 10.00 MB

[Killed] MethodCallRemoval
Infrastructure/Cache/Psr6CacheAdapter.php:27:9
     {
         $item = $this->pool->getItem($this->sanitizeKey($key));
         $item->set($value);
-        $item->expiresAfter($ttl);
+        
         $this->pool->save($item);
     }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.8d4054f0f05e1d2bdcb1723861bcb0ce.infection.xml

F

Time: 00:00.014, Memory: 10.00 MB

[Killed] MethodCallRemoval
Infrastructure/Cache/Psr6CacheAdapter.php:28:9
         $item = $this->pool->getItem($this->sanitizeKey($key));
         $item->set($value);
         $item->expiresAfter($ttl);
-        $this->pool->save($item);
+        
     }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.a3aa09f0dd03d58945c164c5192682d1.infection.xml

F

Time: 00:00.024, Memory: 10.00 MB
