[Killed] PublicVisibility
Infrastructure/Http/ClientAdapterResolver.php:21:5
      *
      * @param class-string<ClientAdapterInterface> $adapterClass
      */
-    public function register(string $clientType, string $adapterClass): void
+    protected function register(string $clientType, string $adapterClass): void
     {
         $this->adapters[$clientType] = $adapterClass;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.27408ca3718dfb3306ef424c6d4a1713.infection.xml

E

Time: 00:00.012, Memory: 10.00 MB

[Killed] PublicVisibility
Infrastructure/Http/ClientAdapterResolver.php:31:5
      *
      * @throws \InvalidArgumentException when the client type is not registered
      */
-    public function resolve(string $clientType): string
+    protected function resolve(string $clientType): string
     {
         if (!isset($this->adapters[$clientType])) {
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.5bfbaae729d77b0b4fbf9c6e7ca9560c.infection.xml

E

Time: 00:00.014, Memory: 10.00 MB

[Killed] LogicalNot
Infrastructure/Http/ClientAdapterResolver.php:33:9
      */
     public function resolve(string $clientType): string
     {
-        if (!isset($this->adapters[$clientType])) {
+        if (isset($this->adapters[$clientType])) {
             throw new \InvalidArgumentException(\sprintf(
                 'Unknown client type "%s". Registered types: %s.',
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.7394dc3f4b26fa3851c46c5b9e0d914c.infection.xml

E

Time: 00:00.017, Memory: 10.00 MB

[Killed] Throw_
Infrastructure/Http/ClientAdapterResolver.php:34:13
     public function resolve(string $clientType): string
     {
         if (!isset($this->adapters[$clientType])) {
-            throw new \InvalidArgumentException(\sprintf(
-                'Unknown client type "%s". Registered types: %s.',
-                $clientType,
-                implode(', ', array_keys($this->adapters)) ?: 'none'
-            ));
+            new \InvalidArgumentException(\sprintf(
         }
 
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.d18e003a8a9624f1b98a21e37341c994.infection.xml

F

Time: 00:00.016, Memory: 10.00 MB

[Killed] Ternary
Infrastructure/Http/ClientAdapterResolver.php:37:17
             throw new \InvalidArgumentException(\sprintf(
                 'Unknown client type "%s". Registered types: %s.',
                 $clientType,
-                implode(', ', array_keys($this->adapters)) ?: 'none'
+                implode(', ', array_keys($this->adapters)) ? 'none' : implode(', ', array_keys($this->adapters))
             ));
         }
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.61e5a15cd209cbc98ce3676baefd392b.infection.xml

F

Time: 00:00.014, Memory: 10.00 MB

[Killed] PublicVisibility
Infrastructure/Http/ClientAdapterResolver.php:45:5
     }
 
     /** @return array<string, class-string<ClientAdapterInterface>> */
-    public function all(): array
+    protected function all(): array
     {
         return $this->adapters;
statusReason: PHPUnit 11.5.55 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.5.6
Configuration: /private/var/folders/_z/c7yb143x0zx41hnz5y3k99lc0000gn/T/infection/phpunitConfiguration.51daed1b7594dfa81c243fc3336edec0.infection.xml

E

Time: 00:00.020, Memory: 10.00 MB
